hw2/hw2.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CIS192 Spring 2013 Homework 2</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="CIS192 Spring 2013 Homework 2"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-08"/>
<meta name="author" content="Zachary Wasserman, Rafe Kettler, Ceasar Bautista"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">CIS192 Spring 2013 Homework 2</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Due Date</h2>
<div class="outline-text-2" id="text-1">

<p>  This homework is due 2012-02-19 at 23:59:59. It should be submitted through
  our homework submission site (described below). Please start early and submit
  with time to spare if you are unfamiliar with Git.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Preparation</h2>
<div class="outline-text-2" id="text-2">

<p>  Retrieve the materials for this assignment by pulling them down from the
  'upstream' remote you created during HW0. Use the command <code>git pull upstream   master</code> in your homework directory as described in the "Working on Homework"
  section of the
  <a href="http://www.seas.upenn.edu/~cis192/submission/hwsubmission.html">submission instructions</a>.
</p>
<p>
  You will also need to install the requests library. Do so with <code>pip install   requests</code> (you may need to <code>sudo</code>).
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Description</h2>
<div class="outline-text-2" id="text-3">

<p>  Start by taking a look at the Philadelphia property taxes API we will be
  working with in this assignment: <a href="http://api.phillyaddress.com/">http://api.phillyaddress.com/</a>. Mostly, we
  will be using the block and owner calls. You may find it easier to explore
  this if you install a JSON pretty-printer in your browser (such as <a href="https://chrome.google.com/webstore/detail/jsonview/chklaanhfefbnpoihckbnefhakgolnmc">JSONView</a>
  for Chrome). You could also use Python and <code>requests</code> for this initial
  exploration, in which case you may find the <code>pprint.pprint</code> function useful.
</p>
<p>
  Implement the functions and classes in the <code>hw2.py</code> file that you will
  retrieve from the upstream git repository. This homework relies heavily on
  concepts from lecture 4, so be sure to take a look at those <a href="http://www.seas.upenn.edu/~cis192/lec4/lec4.pdf">slides</a>.
</p>
<p>
  To run tests, run <code>python hw2.py</code>, or call the <code>main</code> function. We will test
  your code with additional test cases beyond those provided. You should
  implement your own test cases to assert the correctness of your submission.
  Note that <code>nose</code> will automatically detect any test cases in functions with a
  name starting with <code>test</code>. You may also use <code>doctest</code> as you see fit.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Grading</h2>
<div class="outline-text-2" id="text-4">

<p>  This assignment will be graded 60% on correctness, 40% on style. Try to be as
  "Pythonic" as possible. We will provide commentary on your code style via the
  Github submission system. You will have the opportunity to resubmit to improve
  your style grade, but your correctness grade will be capped at that you
  received on the initial submission.
</p>
<p>
  Note: Code that does not run in the Python interpreter due to syntax errors
  will receive <i>no credit</i>
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Collaboration</h2>
<div class="outline-text-2" id="text-5">

<p>  While this course will have opportunities for collaboration, this is an
  <i>individual</i> assignment. All work you submit must be your own. If you use
  resources outside of the official Python online documentation, you must cite
  those resources by commenting your code. We take this seriously, and will use
  all reasonable methods to ensure the integrity of course assignments.
</p></div>
</div>
</div>

</body>
</html>
